ALTER TABLE
    products
DROP CONSTRAINT 
    products_pkey;


-- ALTER TABLE products:

-- Този блок посочва, че ще се извърши промяна в структурата на таблица "products".

-- DROP CONSTRAINT products_pkey:

-- Този блок указва, че ще се премахне (DROP) ограничение (CONSTRAINT) с име "products_pkey" от таблицата "products".
-- "products_pkey" вероятно е името на основния ключ (primary key constraint) в таблицата.
-- След изпълнението на този код, основният ключ "products_pkey" ще бъде премахнат от таблицата "products". 
-- Това означава, че колоната, която представлява основния ключ, вече няма да бъде ограничена от изискването 
-- да бъде уникална и да не може да приема стойности NULL. Така таблицата може да съдържа дублиращи се или NULL 
-- стойности в тази колона, ако не са наложени други ограничения.